name: "mxnet-model"
layer {
  name: "input_data"
  type: "Input"
  top: "data"
  input_param {
    shape {
      dim: 64
      dim: 3
      dim: 224
      dim: 224
    }
  }
}

layer {
  name: "huawei_atlas_inference"
  type: "Atlas"
  bottom: "data"
  top: "prob"
  atlas_param {
      model_name: "/root/Tengine_Atlas/resnet_50/setup.config"
      total_output_layer_nums: 1
      output_shape {
          dim: 64
          dim: 1000
          dim: 1
          dim: 1
      }
  }
}
